tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/3DBox/losses/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
ddtSchemes      
{
    default         steadyState;
}

gradSchemes     
{
    default         Gauss linear;
    gradUATC        cellLimited Gauss linear 1;
    grad(U)         cellLimited Gauss linear 1;
    gradUConv       cellLimited Gauss linear 1;
    gradUaConv      cellLimited Gauss linear 1;
}

divSchemes      
{
    default           Gauss linear;
    div(phi,U)        bounded Gauss linearUpwindV gradUConv;
   "div\(-phi,Ua.*\)" bounded Gauss linearUpwindV gradUaConv;
}

interpolationSchemes 
{
    default         linear;
}

laplacianSchemes 
{
    default         Gauss linear corrected;
}

snGradSchemes   
{
    default         corrected;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

